In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel(r"D:\Coding\Data-Prep-EDA\Code\Data\Student Grades.xlsx")
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [3]:
df.Class.value_counts()

Class
Intro to Python              25
Intro to SQL                 20
EDA                          13
Freshman Seminar             12
Exploratory Data Analysis    12
Python                        1
Name: count, dtype: int64

In [4]:
class_mappings = {"Intro to Python": "Intro to Python",
                  "Intro to SQL": "Intro to SQL",
                  "EDA": "EDA",
                  "Freshman Seminar": "Freshman Seminar",
                  "Exploratory Data Analysis": "EDA",
                  "Python": "Intro to Python"}

In [6]:
df.Class = df.Class.map(class_mappings)
df.Class.value_counts()

Class
Intro to Python     26
EDA                 25
Intro to SQL        20
Freshman Seminar    12
Name: count, dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [8]:
df.Year.str.lower().str.replace("the", "").str.strip('""')

0     freshman
1     freshman
2     freshman
3     freshman
4     freshman
        ...
81         NaN
82         NaN
83      junior
84      senior
85         NaN
Name: Year, Length: 86, dtype: object